<a href='https://www.darshan.ac.in/'> <img src='https://www.darshan.ac.in/Content/media/DU_Logo.svg' width="150" height="200"/></a>
<pre>
<center><b><h2> Python for Data Science - 2305CS303 </b></center>
<center><b><h2>Lab - 9</b></center>    
<left><b><h3>Roll No. : 135</b></left>  
<left><b><h3>Name : Nikhil Rathod</b></left>   
<pre>

### 1. Create a Pandas Series containing names of 5 students.

In [2]:
import pandas as pd
stu = pd.Series(['abc','xyz','pqr','tuv','lop'])
stu

0    abc
1    xyz
2    pqr
3    tuv
4    lop
dtype: object

### 2. Create a Series with student roll numbers as index and their IAT scores as values..

In [3]:
import numpy as np
stu1 = pd.Series([89,78,61,13,23],[1,2,3,4,5])
stu1

1    89
2    78
3    61
4    13
5    23
dtype: int64

### 3. Create a time series (daily) from 2025-08-01 to 2025-08-10 representing attendance tracking for a student.

In [8]:
date='2025-08-01'
c = pd.to_datetime(date)
temp = c + pd.to_timedelta(range(10),unit='D')
pd.Series(['A','P','P','P','A','P','A','A','P','P',],temp)

2025-08-01    A
2025-08-02    P
2025-08-03    P
2025-08-04    P
2025-08-05    A
2025-08-06    P
2025-08-07    A
2025-08-08    A
2025-08-09    P
2025-08-10    P
dtype: object

### 4. Create a DataFrame for 10 students with the following columns: Roll No, Name, PDS, CA, CN, IAT.
#### (Use NumPy random module to generate scores)

In [42]:
studets = {101:"nikhil",102:"ajay",103:"harsh",104:"ronak",105:"uday"}
data = pd.DataFrame(np.random.randint(50,100,20).reshape(5,4),range(0,5),['PDS','CA','CN','IAT'])
data["Roll"] = studets.keys()
data["Name"] = studets.values()
data

   PDS  CA  CN  IAT  Roll    Name
0   63  54  81   73   101  nikhil
1   89  81  98   85   102    ajay
2   87  53  80   60   103   harsh
3   76  59  86   80   104   ronak
4   82  78  88   79   105    uday

### 5. Display the first 3 rows of the DataFrame.

In [43]:
data.head(3)

   PDS  CA  CN  IAT  Roll    Name
0   63  54  81   73   101  nikhil
1   89  81  98   85   102    ajay
2   87  53  80   60   103   harsh

### 6. Display the last 2 rows of the DataFrame.

In [44]:
data.tail(2)

   PDS  CA  CN  IAT  Roll   Name
3   76  59  86   80   104  ronak
4   82  78  88   79   105   uday

### 7. Use .describe() to summarize the numeric data.

In [46]:
data.describe()

             PDS         CA         CN        IAT        Roll
count   5.000000   5.000000   5.000000   5.000000    5.000000
mean   79.400000  65.000000  86.600000  75.400000  103.000000
std    10.454664  13.472194   7.197222   9.607289    1.581139
min    63.000000  53.000000  80.000000  60.000000  101.000000
25%    76.000000  54.000000  81.000000  73.000000  102.000000
50%    82.000000  59.000000  86.000000  79.000000  103.000000
75%    87.000000  78.000000  88.000000  80.000000  104.000000
max    89.000000  81.000000  98.000000  85.000000  105.000000

### 8. Select only the Name column.

In [47]:
data['Name']

0    nikhil
1      ajay
2     harsh
3     ronak
4      uday
Name: Name, dtype: object

### 9. Select the columns PDS, CN, and IAT.

In [49]:
data[['PDS','CN','IAT']]

   PDS  CN  IAT
0   63  81   73
1   89  98   85
2   87  80   60
3   76  86   80
4   82  88   79

### 10. Select the row with Roll No = 105 using loc.

In [52]:
data.loc[4]

PDS       82
CA        78
CN        88
IAT       79
Roll     105
Name    uday
Name: 4, dtype: object

### 11. Select the 4th row using iloc.

In [53]:
data.iloc[4]

PDS       82
CA        78
CN        88
IAT       79
Roll     105
Name    uday
Name: 4, dtype: object

### 12. Select students with marks in PDS > 80.

In [55]:
data.loc[data['PDS']>80]

   PDS  CA  CN  IAT  Roll   Name
1   89  81  98   85   102   ajay
2   87  53  80   60   103  harsh
4   82  78  88   79   105   uday

### 13. Select students with marks in CA < 70.

In [56]:
data.loc[data['CA']>70]

   PDS  CA  CN  IAT  Roll  Name
1   89  81  98   85   102  ajay
4   82  78  88   79   105  uday

### 14. Select students with marks in CN > 85 and PDS > 80

In [57]:
data.loc[(data['CN']>85) & (data['PDS']>80)]

   PDS  CA  CN  IAT  Roll  Name
1   89  81  98   85   102  ajay
4   82  78  88   79   105  uday

### 15. Add a new column Total Marks = PDS + CA + CN + IAT.

In [59]:
data['total']=data['PDS']+data['CA']+data['CN']+data['IAT']
data

   PDS  CA  CN  IAT  Roll    Name  total
0   63  54  81   73   101  nikhil    271
1   89  81  98   85   102    ajay    353
2   87  53  80   60   103   harsh    280
3   76  59  86   80   104   ronak    301
4   82  78  88   79   105    uday    327

### 16. Create a new DataFrame of students with Total Marks > 320.

In [60]:
data.loc[data['total']>320]

   PDS  CA  CN  IAT  Roll  Name  total
1   89  81  98   85   102  ajay    353
4   82  78  88   79   105  uday    327